SQL/Active Record/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("user_id", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["long_url", "www.website.com"], ["short_url", "TLImTW1gtyGUk9kRmoDHiw"], ["created_at", "2020-11-23 18:34:51.591281"], ["updated_at", "2020-11-23 18:34:51.591281"]]
---
  def factory(user,long_url_string)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url_string, short_url: ShortenedUrl.random_code)

SELECT "shortened_urls".* FROM "shortened_urls" WHERE (id NOT IN (1) AND user_id NOT IN (1))
SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."created_at" BETWEEN $1 AND $2 AND "shortened_urls"."user_id" = $3  [["created_at", "2020-11-23 18:33:51.577921"], ["created_at", "2020-11-23 18:34:51.578069"], ["user_id", 2]]
---
  def no_spamming
    creation_count = ShortenedUrl.where({created_at: (1.minute.ago)..(Time.now.utc),user_id: self.user_id}).count

SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 2]]
---
  def nonpremium_max
    user_submit_count = ShortenedUrl.where(user_id: self.user_id).count