SQL/Active Record/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "TLImTW1gtyGUk9kRmoDHiw"], ["LIMIT", 1]]
---
  def self.random_code
    code = ""
    while true
      code = SecureRandom::urlsafe_base64
      break unless self.exists?(short_url: code)

SELECT "shortened_urls".* FROM "shortened_urls" WHERE (user_id IN (1))
SELECT "users".* FROM "users" WHERE "users"."premium" = $1  [["premium", true]]
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 2]]
SELECT "shortened_urls".* FROM "shortened_urls" INNER JOIN "visits" ON "visits"."shortened_url_id" = "shortened_urls"."id" WHERE NOT (visits.created_at BETWEEN ('2020-11-24 13:12:19.300565') AND ('2020-11-24 13:13:19.300610'))
SELECT "visits".* FROM "visits" WHERE "visits"."shortened_url_id" = $1  [["shortened_url_id", 1]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 1]]
---
  def self.prune(n)
    # Visit.where.not(created_at: (n.minutes.ago)..(Time.now.utc))
    # destroyed = ShortenedUrl.joins(:visits).where.not("visits.created_at BETWEEN (?) AND (?)", (n.minutes.ago),(Time.now.utc)).joi
    # .to_a.concat(ShortenedUrl.where.not(id: (ShortenedUrl.all.joins(:visits).map(&:id))
    # )).destroy_all

    premium_ids = ShortenedUrl.where("user_id IN (?)",User.where(premium: true).map(&:id)).map(&:id)
    # return
    # return premium_ids
    # return ShortenedUrl.joins(:visits).where.not("visits.created_at BETWEEN (?) AND (?)", (1.minutes.ago),(Time.now.utc)) + ShortenedUrl.where.not(id: (ShortenedUrl.all.joins(:visits).map(&:id)))
    # -->destroyed =  ShortenedUrl.where("id IN (?)",ShortenedUrl.joins(:visits).where.not("visits.created_at BETWEEN (?) AND (?)", (1.minutes.ago),(Time.now.utc)) + ShortenedUrl.where.not(id: (ShortenedUrl.all.joins(:visits).map(&:id))))
    destroyed = ShortenedUrl.joins(:visits).where.not("visits.created_at BETWEEN (?) AND (?)", (1.minutes.ago),(Time.now.utc)) + ShortenedUrl.where.not(id: (ShortenedUrl.all.joins(:visits).map(&:id) + premium_ids)).destroy_all


    destroyed.each do |obj|
      tags = obj.taggings
      tags.destroy_all

      visits = obj.visits
      visits.destroy_all

INSERT INTO "shortened_urls" ("user_id", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["long_url", "www.webiste.com"], ["short_url", "VKWRm4LsLQzhALwJUM0CkA"], ["created_at", "2020-11-24 14:58:02.606573"], ["updated_at", "2020-11-24 14:58:02.606573"]]
---
  def self.factory(user,long_url_string)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url_string, short_url: ShortenedUrl.random_code)

SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."created_at" BETWEEN $1 AND $2 AND "shortened_urls"."user_id" = $3  [["created_at", "2020-11-24 14:57:02.595249"], ["created_at", "2020-11-24 14:58:02.595428"], ["user_id", 3]]
---
  def no_spamming
    creation_count = ShortenedUrl.where({created_at: (1.minute.ago)..(Time.now.utc),user_id: self.user_id}).count

SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 3]]
---
  def nonpremium_max
    user_submit_count = ShortenedUrl.where(user_id: self.user_id).count