SQL/Active Record/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 6], ["created_at", "2020-11-23 05:05:43.228731"], ["updated_at", "2020-11-23 05:05:43.228731"]]
---
  def self.factory!(user,shortened_url)
    if Visit.exists?(shortened_url.id)
      Visit.delete(shortened_url)
    end
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)